In [2]:
import pandas as pd
import numpy as np

# Преобразование данных

In [2]:
# До сих пор мы рассматривали реорганизацию данных. Фильтрация, очистка и прочее тоже очень важный класс операций.

# Устранение дубликатов

In [3]:
# Строки дубликаты могут появиться в Pandas по разным причинам:

In [4]:
data = pd.DataFrame({'k1' : ['one'] *3 + ['two']*4, 'k2' : [1, 1, 2, 3, 3, 4, 4]})

In [6]:
data # видим много дубликатов

    k1  k2
0  one   1
1  one   1
2  one   2
3  two   3
4  two   3
5  two   4
6  two   4

In [7]:
# Метод duplicated() объекта DataFrame возвращает булев массив Series, который для каждой строки показывает
# есть ли в ней дубликаты

data.duplicated()

0    False
1     True
2    False
3    False
4     True
5    False
6     True
dtype: bool

In [10]:
# А метод drop_duplicates() возвращает DataFrame, для которого массив, возвращенный методом duplicated()
# будет содержать только значения False, то есть он выберет только уникальные строки и переиндексирует новый объект

data.drop_duplicates() # метод оставил только уникальные строки (убрал дубликаты)

    k1  k2
0  one   1
2  one   2
3  two   3
5  two   4

In [11]:
# По умолчанию оба метода принимают во внимание все столбцы, но можно указать произвольное подмножество столбцов
# которые необъодимо исследовать на наличие дубликатов. Допустим, есть еще один столбец значений,
# и мы хотим отфильтровать строки, которые содержат повторяющиеся значения в столбце 'k1':

In [12]:
data

    k1  k2
0  one   1
1  one   1
2  one   2
3  two   3
4  two   3
5  two   4
6  two   4

In [15]:
data['v1'] = range(7) # добавили новый столбец через присваивание

In [16]:
data

    k1  k2  v1
0  one   1   0
1  one   1   1
2  one   2   2
3  two   3   3
4  two   3   4
5  two   4   5
6  two   4   6

In [19]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
3  two   3   3

In [21]:
data.duplicated(['k1'])

0    False
1     True
2     True
3    False
4     True
5     True
6     True
dtype: bool

In [24]:
# По умолчанию методы duplicated и drop_duplicates оставляют первую встретившуюся строку с данной комбинацией 
# значений. Но если задать параметр keep='last', то будет оставлена последняя строка:

data.drop_duplicates(['k1'], keep='last')

    k1  k2  v1
2  one   2   2
6  two   4   6

In [25]:
# Еще немного поиграю с фильтрацией

In [26]:
data

    k1  k2  v1
0  one   1   0
1  one   1   1
2  one   2   2
3  two   3   3
4  two   3   4
5  two   4   5
6  two   4   6

In [27]:
data.drop_duplicates(['k2']) # в общем, мы просто смотрим относительно указнного столбца уникальные значения в других

    k1  k2  v1
0  one   1   0
2  one   2   2
3  two   3   3
5  two   4   5

# Преобразование данных с помощью функций или отображения

In [1]:
# Часто бывает необходимо приозвести преобразование набора данных исходя из значений в некотором массиве, объектe
# Series или столбца объекта DataFrame.
# Рассмотрим пример о сортах мяса

In [2]:
import pandas as pd
import numpy as np

In [4]:
data = pd.DataFrame({'food' : ['bacon', 'pulled pork', 'bacon', 'Pastrami', 'corned beef', 'Bacon', 'pastrami',
'honey ham', 'nova lox'], 'ounces' : [4,3,12,6,7.5,8,3,5,6]})

In [5]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [6]:
# Допустим, требуется добавиться столбец, в котором указывается соответствующие сорту мяса животное.
# Создадим отображение сортов мяса на виды животных:

In [22]:
meat_to_animal = {
    'bacon' : 'pig',
    'pulled pork' : 'pig',
    'pastrami' : 'cow',
    'corned beef' : 'cow',
    'honey ham' : 'pig',
    'nova lox' : 'salmon'    
}

In [8]:
# Метод map объекта Series принимает функцию или похожий на словарь объект, содержащий отображение, но в данном
# случае у нас возникает проблема - некоторые сорта мяса начинаются с заглавной буквы, а других со строчной. Поэтому
# сначала нужно привести все строки к нижнему регистру методом str.lower объекта Series:

In [9]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [13]:
lower = data['food'].str.lower()

In [14]:
lower

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [15]:
data['animal'] = lower

In [16]:
data

          food  ounces       animal
0        bacon     4.0        bacon
1  pulled pork     3.0  pulled pork
2        bacon    12.0        bacon
3     Pastrami     6.0     pastrami
4  corned beef     7.5  corned beef
5        Bacon     8.0        bacon
6     pastrami     3.0     pastrami
7    honey ham     5.0    honey ham
8     nova lox     6.0     nova lox

In [23]:
data['animal'] = lower.map(meat_to_animal)

In [24]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [25]:
# То есть через map() я передал словарь-отображение и там поставил в новый столбец в соответствие

In [26]:
# Можно было также передать функцию, выполняющу всю эту работу

In [32]:
data2 = data.copy()

In [33]:
data2

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [36]:
data2['animal2'] = data2['food'].map(lambda x : meat_to_animal[x.lower()]) # отображение через саму функцию

In [37]:
data2

          food  ounces  animal animal2
0        bacon     4.0     pig     pig
1  pulled pork     3.0     pig     pig
2        bacon    12.0     pig     pig
3     Pastrami     6.0     cow     cow
4  corned beef     7.5     cow     cow
5        Bacon     8.0     pig     pig
6     pastrami     3.0     cow     cow
7    honey ham     5.0     pig     pig
8     nova lox     6.0  salmon  salmon

In [38]:
# Метод map - удобное средство выполненения поэлементных преобразований и других операций очистки

# Замена значений

In [40]:
# Восполнение отсутствующих данных методом fillna можно рассматривать как частный случай более общей замены значений
# Если метод map, как мы видели выше, позволяет модицифировать подмножество значений, хранящихся в объекте,
# то метод replace() предлагает для этого более простой и гибкий интерфейс.


data = pd.Series([1, -999, -999, 4, 6, 1000, 9, 1000, 1000])

In [41]:
data

0       1
1    -999
2    -999
3       4
4       6
5    1000
6       9
7    1000
8    1000
dtype: int64

In [43]:
data.replace(-999, np.nan) # порождается новый объект. Если надо поменять на месте, то используем inplace=True

0       1.0
1       NaN
2       NaN
3       4.0
4       6.0
5    1000.0
6       9.0
7    1000.0
8    1000.0
dtype: float64

In [46]:
# странная особенность, если просто поставить значения, которые хотим заменить в [], то оин заменятся на значения,
# которые стояли выше них

data.replace([-999, np.nan, 1000])

0    1
1    1
2    1
3    4
4    6
5    6
6    9
7    9
8    9
dtype: int64

In [48]:
data.replace([-999, 1000], np.nan) # а уже при таком способе заменится как хотим

0    1.0
1    NaN
2    NaN
3    4.0
4    6.0
5    NaN
6    9.0
7    NaN
8    NaN
dtype: float64

In [51]:
# Если для каждого заменяемого значения нужно свое заменяющее, передаем список замен:

data.replace([-999, 1000], [np.nan, 5]) # здесь происхоит взаимооднозначное соответствие

0    1.0
1    NaN
2    NaN
3    4.0
4    6.0
5    5.0
6    9.0
7    5.0
8    5.0
dtype: float64

In [52]:
# В аргументе можно передать словарь:

In [54]:
data.replace({-999 : np.nan}) # то есть словарь это и есть взаимооднозначное отображение, поэтому в map применяем его

0       1.0
1       NaN
2       NaN
3       4.0
4       6.0
5    1000.0
6       9.0
7    1000.0
8    1000.0
dtype: float64

In [55]:
# Метод data.replace не то же самое, что метод data.str.replace, который выполняет поэлементную замену строки

In [56]:
# А как метод replace() ведет себя с DataFrame?

In [57]:
data2

          food  ounces  animal animal2
0        bacon     4.0     pig     pig
1  pulled pork     3.0     pig     pig
2        bacon    12.0     pig     pig
3     Pastrami     6.0     cow     cow
4  corned beef     7.5     cow     cow
5        Bacon     8.0     pig     pig
6     pastrami     3.0     cow     cow
7    honey ham     5.0     pig     pig
8     nova lox     6.0  salmon  salmon

In [58]:
data2.replace('pig', np.nan)

          food  ounces  animal animal2
0        bacon     4.0     NaN     NaN
1  pulled pork     3.0     NaN     NaN
2        bacon    12.0     NaN     NaN
3     Pastrami     6.0     cow     cow
4  corned beef     7.5     cow     cow
5        Bacon     8.0     NaN     NaN
6     pastrami     3.0     cow     cow
7    honey ham     5.0     NaN     NaN
8     nova lox     6.0  salmon  salmon

In [68]:
data2.iloc[:].replace({'bacon' : np.nan})

          food  ounces  animal animal2
0          NaN     4.0     pig     pig
1  pulled pork     3.0     pig     pig
2          NaN    12.0     pig     pig
3     Pastrami     6.0     cow     cow
4  corned beef     7.5     cow     cow
5        Bacon     8.0     pig     pig
6     pastrami     3.0     cow     cow
7    honey ham     5.0     pig     pig
8     nova lox     6.0  salmon  salmon

In [61]:
# Все тоже самое

In [67]:
data2.replace({'bacon' : np.nan})

          food  ounces  animal animal2
0          NaN     4.0     pig     pig
1  pulled pork     3.0     pig     pig
2          NaN    12.0     pig     pig
3     Pastrami     6.0     cow     cow
4  corned beef     7.5     cow     cow
5        Bacon     8.0     pig     pig
6     pastrami     3.0     cow     cow
7    honey ham     5.0     pig     pig
8     nova lox     6.0  salmon  salmon

# Переименование индексов осей

In [69]:
# Как и значения в объекте Series, метки осей можно преобразовывать с помощью функции или отображения,
# порождающего новые объекты с другими метками. Оси можно также модифицировать на месте, не создавая новую
# структуру данных.

In [74]:
data = pd.DataFrame(np.arange(12).reshape(3,4), index=['Ohio', 'Moscow', 'Ruza'], columns=['one', 'two', 'three', 'four'])
data

        one  two  three  four
Ohio      0    1      2     3
Moscow    4    5      6     7
Ruza      8    9     10    11

In [75]:
# Как и у объекта Series, у индексов есть метод map:

transform = lambda x: x[:4].upper()

In [76]:
data.index

Index(['Ohio', 'Moscow', 'Ruza'], dtype='object')

In [77]:
data.index.map(transform)

Index(['OHIO', 'MOSC', 'RUZA'], dtype='object')

In [78]:
data.index.name = 'h'

In [79]:
data

        one  two  three  four
h
Ohio      0    1      2     3
Moscow    4    5      6     7
Ruza      8    9     10    11

In [80]:
data.index

Index(['Ohio', 'Moscow', 'Ruza'], dtype='object', name='h')

In [85]:
data.index = data.index.map(str.upper) #upper без скобок!!!!

In [86]:
data

        one  two  three  four
h
OHIO      0    1      2     3
MOSCOW    4    5      6     7
RUZA      8    9     10    11

In [87]:
# Если требуется создать преобразованный вариант набора данных, не меняя оригинал, то
#  будет полезен метод rename()

In [88]:
data

        one  two  three  four
h
OHIO      0    1      2     3
MOSCOW    4    5      6     7
RUZA      8    9     10    11

In [91]:
data.rename(index=str.title)

        one  two  three  four
h
Ohio      0    1      2     3
Moscow    4    5      6     7
Ruza      8    9     10    11

In [93]:
data.rename(index=str.title, columns=str.upper)

        ONE  TWO  THREE  FOUR
h
Ohio      0    1      2     3
Moscow    4    5      6     7
Ruza      8    9     10    11

In [94]:
data

        one  two  three  four
h
OHIO      0    1      2     3
MOSCOW    4    5      6     7
RUZA      8    9     10    11

In [95]:
# Интересно!!! Что rename можно использовать с похожим на словарь объектом, который возвращает
# новые значения для подмножества меток оси:

In [96]:
data.rename(index={'OHIO' : 'Ruuuza'})

        one  two  three  four
h
Ruuuza    0    1      2     3
MOSCOW    4    5      6     7
RUZA      8    9     10    11

In [97]:
# Метод rename избавляет от необходимости копировать объект DataFrame вручную и присваивать значения его
# атрибутам index и columns. Чтобы модифицировать набор данных на месте, задайте параметр inplace=True

In [98]:
data

        one  two  three  four
h
OHIO      0    1      2     3
MOSCOW    4    5      6     7
RUZA      8    9     10    11

In [99]:
data.rename(index={'OHIO' : 'rUzA)))'}, inplace=True)

In [100]:
data

         one  two  three  four
h
rUzA)))    0    1      2     3
MOSCOW     4    5      6     7
RUZA       8    9     10    11

# Дискретизация и раскладывание

In [101]:
# Непрерывные данные часто дискретизируются или как-то иначе раскладываются по интервалам - ящикам для анализа.
# Предположим, что имеются данные о группе лиц в исследовании, и требуется их разложить по ящикам,
# соответствующим возрасту - дискретной величине:

ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32, 34, 65, 77, 23, 19, 20]

In [102]:
# Разобьем эти ящики на группы : 18-25, 26-35, 36-60, 61+ лет. Для этого в Pandas есть функция cut:

In [109]:
# Пример

bins = [18, 25, 35, 60, 100] # bins переводится как ящики, ведра

cats = pd.cut(ages, bins)

In [104]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (60, 100], (60, 100], (18, 25], (18, 25], (18, 25]]
Length: 18
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [105]:
# Pandas возвращает специальный объект Categorial. Показанный выше результат - это ящики, вычисленный
# методом pandas.cut(). Его можно рассматривать как массив строк с именанми ящиков; на самом деле он 
# содержит массив categories, в котором хранятся неповторяющиеся имена категорий, а также метки данных
# ages в атрибуте codes

cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1, 1, 3, 3, 0, 0, 0], dtype=int8)

In [106]:
# 0 - к первой категории
# 1 - ко второй категрии
# и так далее, то есть атрибут codes показывает эти категрии
#

In [108]:
cats.categories # показывает наши разделяемые категории

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [110]:
# А давай попробуем посчитать сколько значений попало в каждую категорию!
# Функция value_counts() используется для получения Series, содержащего уникальные значения. 
# Она вернет результат, отсортированный в порядке убывания, так что первый элемент 
# в коллекции будет самым встречаемым. NA-значения не включены в результат.

In [115]:
data2

          food  ounces  animal animal2
0        bacon     4.0     pig     pig
1  pulled pork     3.0     pig     pig
2        bacon    12.0     pig     pig
3     Pastrami     6.0     cow     cow
4  corned beef     7.5     cow     cow
5        Bacon     8.0     pig     pig
6     pastrami     3.0     cow     cow
7    honey ham     5.0     pig     pig
8     nova lox     6.0  salmon  salmon

In [121]:
data2.iloc[0].value_counts() # логично, в этой строке вывело повторяемост каждого элемента

pig      2
bacon    1
4.0      1
Name: 0, dtype: int64

In [119]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (60, 100], (60, 100], (18, 25], (18, 25], (18, 25]]
Length: 18
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [123]:
pd.value_counts(cats) # счетчик элементов, что попали в каждый ящик! Довольно полезно!

(18, 25]     8
(25, 35]     4
(35, 60]     3
(60, 100]    3
dtype: int64

In [127]:
# По умолчанию, правый конец включается. Чтобы сделать его открытым, то есть ')' нужно передать 
# параметр right=False

pd.cut(ages, [18, 26, 36, 61, 100], right=False) # правый вообще нигде не включается

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [61, 100), [61, 100), [18, 26), [18, 26), [18, 26)]
Length: 18
Categories (4, interval[int64, left]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [129]:
# Можно также самостояльно задать имена ящиков, передав список или массив в параметр labels. То есть, если 
# до этого были просто имена ящиков по типу (18, 25), то теперь я могу дать им имя с помощью этого параметра.

group_names = ['Молодые', 'Средние', 'Пожилые', 'Старые']

pd.cut(ages, bins, labels=group_names)

['Молодые', 'Молодые', 'Молодые', 'Средние', 'Молодые', ..., 'Старые', 'Старые', 'Молодые', 'Молодые', 'Молодые']
Length: 18
Categories (4, object): ['Молодые' < 'Средние' < 'Пожилые' < 'Старые']

In [130]:
# Если передать методу cut целое число ящиков, а не явно заданные границы, то он разобьет данные на группы
# равной длины исходя из минимального и максимального значения. Рассмотрим, например, для разложения в 4 ящика

pd.cut(ages, 4)

[(18.942, 33.5], (18.942, 33.5], (18.942, 33.5], (18.942, 33.5], (18.942, 33.5], ..., (62.5, 77.0], (62.5, 77.0], (18.942, 33.5], (18.942, 33.5], (18.942, 33.5]]
Length: 18
Categories (4, interval[float64, right]): [(18.942, 33.5] < (33.5, 48.0] < (48.0, 62.5] < (62.5, 77.0]]

In [133]:
pd.cut(ages, 3)

[(18.942, 38.333], (18.942, 38.333], (18.942, 38.333], (18.942, 38.333], (18.942, 38.333], ..., (57.667, 77.0], (57.667, 77.0], (18.942, 38.333], (18.942, 38.333], (18.942, 38.333]]
Length: 18
Categories (3, interval[float64, right]): [(18.942, 38.333] < (38.333, 57.667] < (57.667, 77.0]]

In [135]:
# Рассмотрим другие данные и попытаемся разложить их на 4 ящика:

data = np.random.randn(20)
data

array([ 0.2723367 , -0.73165046,  0.53344986,  0.32616876,  2.39026893,
       -0.29788648,  2.39545036,  0.91981794,  0.75178279, -0.9236708 ,
       -0.46467506, -2.20990651, -0.96650666, -0.70343003, -0.53662439,
       -0.96871076,  0.78573235,  0.9418186 , -0.06517197,  0.43219231])

In [136]:
pd.cut(data, 4)

[(0.0928, 1.244], (-1.059, 0.0928], (0.0928, 1.244], (0.0928, 1.244], (1.244, 2.395], ..., (-1.059, 0.0928], (0.0928, 1.244], (0.0928, 1.244], (-1.059, 0.0928], (0.0928, 1.244]]
Length: 20
Categories (4, interval[float64, right]): [(-2.215, -1.059] < (-1.059, 0.0928] < (0.0928, 1.244] < (1.244, 2.395]]

In [137]:
pd.cut(data, 2)

[(0.0928, 2.395], (-2.215, 0.0928], (0.0928, 2.395], (0.0928, 2.395], (0.0928, 2.395], ..., (-2.215, 0.0928], (0.0928, 2.395], (0.0928, 2.395], (-2.215, 0.0928], (0.0928, 2.395]]
Length: 20
Categories (2, interval[float64, right]): [(-2.215, 0.0928] < (0.0928, 2.395]]

In [138]:
pd.cut(data, 4, precision=1) # presision переводится как точность, то есть здесь я поставил точность 1 знак после запятой

[(0.09, 1.2], (-1.1, 0.09], (0.09, 1.2], (0.09, 1.2], (1.2, 2.4], ..., (-1.1, 0.09], (0.09, 1.2], (0.09, 1.2], (-1.1, 0.09], (0.09, 1.2]]
Length: 20
Categories (4, interval[float64, right]): [(-2.2, -1.1] < (-1.1, 0.09] < (0.09, 1.2] < (1.2, 2.4]]

In [139]:
# Родственная функция qcut (разбиваем на квартили) раскладывает данные исходя из выборочных квантилей.
# Метод qut (переводится как бросить) обычно создает ящики, содержащие разное число точек, - это всецело
# устанавливается распределениями данных. Но поскольку qcut пользуется выборочными квантилями, то
# по определению получаются ящики равного размера:


# Напомню, что квантиль это значение, которое заданная величина НЕ ПРЕВЫШАЕТ с фиксированной вероятностью.
# Если вероятность задана в процентах, то квантиль называют перцентилем.
#
# Пример, фраза: "90-й процентиль массы тела новорожденных мальчиков составялет 4 кг." Это означает, что 90% мальчиков 
# рождаеются с меньшим или равным весом 4 кг. А остальные 10% больше 4 кг.

In [140]:
data = np.random.randn(1000) # нормальное распределение

In [143]:
data

array([-4.69599852e-01, -9.16713715e-03,  1.02056868e+00,  2.64072279e-01,
       -2.48364866e-01, -1.64867939e+00, -8.37420352e-01, -1.14876587e+00,
        1.33584231e+00, -1.29598019e+00, -3.24039314e+00,  4.07248559e-01,
       -2.06496773e-02,  5.17741427e-01, -9.80040945e-01,  5.03220353e-01,
        4.52848957e-01, -1.08060411e-01,  3.06105309e-02, -8.68886870e-02,
       -5.58015624e-01, -1.19915816e+00, -6.05099855e-01,  6.96675531e-03,
       -1.54350683e+00, -1.42798942e+00, -3.70341885e-01,  7.99331101e-01,
        7.46048683e-01, -1.81111540e-01,  1.06501674e+00, -1.06489109e+00,
        7.68864048e-01, -1.14562631e+00,  1.50970540e+00, -6.70960388e-01,
        9.22255964e-01,  5.95594606e-01, -1.38802138e+00,  6.32066302e-01,
       -5.44637685e-01, -2.05745959e+00,  1.90213371e-02, -7.79360200e-02,
        7.10299523e-01,  3.73936824e-01,  3.26345354e-01, -5.94051640e-01,
       -8.68552509e-01,  1.54635207e-01,  4.77756858e-02, -4.77415639e-02,
       -4.27115293e-01, -8.06642479e-01,  1.72495029e+00, -9.17063772e-01,
        5.22597755e-01,  7.06728716e-01, -3.37654335e-01,  1.62124556e+00,
        1.44312158e-01, -9.03305562e-01,  5.26365348e-01,  6.09406372e-01,
       -4.53877585e-01,  7.06639854e-01, -7.22997666e-01, -3.42068616e-01,
        1.24439409e+00,  2.19261400e-01, -3.31110411e-01,  2.46233377e-01,
        5.05523340e-01,  9.49173169e-01, -1.74589391e+00, -9.07975594e-01,
        2.15529030e+00,  9.14332341e-01, -6.70595205e-01, -9.91942901e-01,
       -1.61745623e+00, -7.44800716e-01,  4.24806391e-01, -8.31579454e-02,
        9.26346288e-01, -4.33678415e-01,  1.87203660e-01, -1.20702936e+00,
        7.21673348e-01, -1.43761664e+00, -5.74582471e-01,  1.90065270e-01,
        3.67153618e-01, -5.47669655e-01,  6.52334517e-01, -7.67527625e-01,
       -2.96991696e-01, -1.26336255e+00, -1.93676128e-01,  8.46456487e-01,
        1.88585164e+00, -1.40733042e+00,  1.44692205e+00, -5.33469719e-01,
        1.31877278e+00, -7.53198054e-01, -1.34454974e-01, -2.04704176e+00,
       -1.63788731e+00,  1.61850263e+00, -1.64376706e-02,  9.46391552e-01,
       -6.89857702e-02,  3.16007521e-01,  8.90402547e-01, -2.49221834e-01,
       -1.79219791e+00,  1.84775549e-02,  7.68969100e-01,  1.03771543e+00,
       -4.57001228e-01, -4.71748408e-01,  2.54544609e-01,  1.77027295e-01,
        2.87649849e-01, -6.16307700e-01, -1.42856042e+00,  1.96362408e+00,
        3.72758862e-01, -1.69608970e+00, -5.19413890e-02, -1.51699300e+00,
       -1.90373403e+00,  2.40918414e-01,  8.07026172e-02, -8.23689142e-01,
        8.80446695e-01,  1.25581923e+00,  1.06644394e+00, -9.78550165e-01,
        1.62170642e+00,  1.82605980e-01,  3.48408025e-02, -2.69731059e+00,
        4.54878092e-01, -5.46670190e-01,  1.46177351e+00, -2.33160846e+00,
       -5.92464433e-01, -6.58751822e-02, -1.46094547e+00,  5.38653297e-01,
        1.39985846e+00,  6.08223398e-01,  5.28963079e-01, -6.75410097e-01,
       -1.00708812e+00, -4.58573802e-01, -1.93798114e-01,  1.25840683e+00,
        7.70000496e-01,  8.63903747e-01,  1.59887684e+00,  1.30104164e+00,
        1.60559148e-01, -1.48975291e+00, -4.45496299e-01,  3.13983099e-01,
       -1.62736037e+00, -1.38959300e+00,  1.07739263e+00,  2.33753068e-01,
        5.83347137e-01,  1.88045283e-01, -8.06639053e-02, -2.96199281e-01,
       -1.43530386e+00,  1.07194652e+00,  1.42779427e+00,  2.77369344e+00,
        1.56051715e-01, -7.89829315e-01,  1.13873079e+00, -1.01378287e+00,
       -3.56537506e-01, -2.18626613e+00, -1.08132101e-01,  7.30793719e-01,
        8.52938483e-01, -1.15685797e-01,  3.13352215e-01, -5.66167722e-01,
       -1.41908355e+00,  7.75180246e-01,  1.16038858e-01,  6.20378604e-01,
       -1.52328171e+00, -1.27228016e+00,  4.10965647e-01, -5.13965703e-01,
       -1.51839242e-01, -3.57736498e-01, -2.11575693e+00, -6.62833910e-01,
       -5.01411126e-01,  4.02495776e-01,  6.81348273e-01, -8.76445521e-01,
        1.25096667e+00,  4.68767171e-01, -8.63872019e-01,  1.03113579e+00,
       -1.47145494e+00,  1.28732256e+00,  4.93365588e-01,  4.25101461e-01,
        1.59270359e+00, -1.12538827e+00,  3.14052998e-01,  6.52382905e-01,
        7.39493364e-01,  1.06101806e-01,  6.74670276e-01,  1.64720847e+00,
        1.21567196e-02,  4.03674747e-01, -2.73783240e-01, -1.88319734e+00,
       -1.21286151e+00,  8.91468794e-01,  3.46000905e-01, -2.10753977e+00,
       -1.26507574e+00, -1.08788134e+00,  5.21139724e-01, -1.35411204e+00,
        1.77284949e+00, -1.55507119e+00, -9.84538642e-02,  1.18754057e+00,
        1.26681129e+00,  1.35718693e+00, -3.29425360e+00, -1.33469486e-01,
        7.82110221e-01,  4.50645886e-01,  6.49689525e-01, -3.19042515e+00,
       -6.95594339e-01, -1.49028733e+00,  2.36627161e-01,  3.07842274e-01,
        1.19652501e+00, -1.54054001e+00,  5.60895577e-01, -1.88474995e-01,
       -8.16571194e-01,  2.76444195e-01,  4.67227399e-01, -2.72782187e+00,
        3.58608309e-02, -6.49876115e-01, -7.52080029e-01, -1.19734850e+00,
        2.49335098e+00,  2.03431945e-01,  6.49527684e-01,  7.07084568e-01,
        3.84562677e-01,  7.08455150e-01, -9.96736077e-01,  6.30167522e-01,
       -8.83541159e-01,  1.12537584e+00, -5.87557384e-01, -3.72240080e-01,
        8.45788697e-01,  1.59884440e+00,  2.25567545e-01, -1.71032409e-01,
        1.21267544e+00, -2.01096356e+00, -5.12399199e-01,  1.80093144e-01,
       -5.09348509e-01, -1.76233285e-01, -1.74072334e-01, -6.65026315e-01,
       -5.00512592e-01, -1.13476962e-01,  6.96723036e-01,  5.90879981e-02,
       -1.04240038e+00,  5.31628663e-01,  1.14577561e-02, -1.76248640e-01,
       -1.06457331e-02, -9.76742948e-02, -5.36563904e-01,  1.44779909e+00,
       -2.11539358e+00, -2.16379815e+00,  2.81597561e+00,  2.16183512e-01,
        7.96076551e-02, -5.31025335e-01,  1.21928109e+00, -3.33864785e-01,
       -6.49352071e-01,  5.45346234e-01,  1.54536817e+00, -9.17688156e-01,
       -7.91018174e-01,  5.20984221e-01,  2.62561077e+00,  8.77319594e-01,
        2.17810203e-02,  4.99245668e-01, -6.12234001e-01,  1.36948217e+00,
        1.00658060e+00,  5.04091881e-01,  3.05209208e-01,  1.90106255e-01,
        6.45970162e-01, -8.41360758e-01, -3.80130267e-01,  1.83214171e+00,
       -9.20624253e-01,  6.53799915e-01, -2.06907688e+00,  1.20551450e-01,
        3.50725235e-01, -1.43894257e-01,  1.11493471e-04, -5.05166284e-01,
        8.54953441e-01,  4.62743335e-01,  2.11474781e-01,  9.41274731e-01,
       -1.92311188e+00, -2.81975916e-01, -6.61980688e-01,  1.23397000e+00,
        1.52958347e+00,  4.16643661e-02, -4.56051956e-01, -9.78214734e-01,
       -7.62566522e-02,  8.53587905e-01,  1.54100358e+00, -1.23150517e-01,
        1.37226406e+00,  9.04040163e-02,  4.04362500e-01,  3.32025669e-01,
       -1.95638752e+00, -5.40151074e-02,  5.24331189e-01,  2.70016807e-02,
        9.70764863e-02,  1.90654031e+00, -2.66911079e-01,  8.54143824e-02,
       -1.01793087e+00,  1.01796374e-01, -2.63786149e-01,  1.92756713e+00,
        3.85326929e-01, -1.05201396e+00, -4.60166384e-01,  2.48760599e-01,
       -7.81939101e-01, -1.34910800e+00, -4.92000883e-01,  2.05241022e-01,
       -4.65374141e-01,  2.96076167e-01,  7.84959608e-01,  8.10686315e-01,
       -3.98063144e-01, -1.31658483e+00,  6.16633484e-01,  1.26373205e-02,
       -9.15200864e-01,  2.61061997e-01, -6.90994855e-01, -4.27924233e-01,
        1.18699003e+00, -3.24117951e-01, -8.29894881e-01, -1.15200660e+00,
       -7.12070675e-01,  1.29550622e+00,  5.57944800e-01, -3.24229134e-01,
       -7.51006956e-01,  6.61320107e-01, -1.46553000e-01, -2.91032160e-01,
        1.47156734e-01, -2.54731325e-02,  1.96386094e+00, -6.71209679e-01,
       -4.47811233e-01, -9.01329159e-01,  2.15374815e+00,  1.08385382e+00,
       -5.09913921e-01,  1.86070597e-01,  1.19981909e+00,  1.40725884e-01,
       -6.57383899e-01,  5.60199599e-01,  1.21043023e-01,  9.82720343e-01,
       -6.34714286e-01, -1.57430486e+00, -1.22966001e+00,  2.03948271e+00,
       -4.40616743e-01, -2.36976068e+00, -1.73648373e+00,  7.86920193e-01,
        9.30981875e-02,  9.98071793e-01, -1.68152016e+00, -1.15020064e-01,
       -2.05264387e+00, -2.02968367e+00, -9.33788845e-01,  6.43407727e-01,
       -2.51531662e-01,  4.25353454e-01,  7.36099888e-01, -2.90680769e+00,
       -7.14475129e-02,  1.72024454e-02,  2.69455867e+00,  5.65114330e-01,
        6.78763915e-01, -1.07952448e+00, -1.95549850e-01, -1.24973330e+00,
        8.64454854e-01, -3.80868876e-01,  1.64104868e+00,  4.51824514e-01,
       -1.13920545e+00,  7.39486536e-01, -5.70112912e-01,  4.72934452e-02,
        3.32941768e-01, -1.72967023e+00,  6.46372624e-01,  6.08948239e-02,
        1.78224546e+00,  1.94320754e+00,  1.57771371e+00, -3.08274864e-01,
        1.38173800e+00, -3.29685961e-01,  2.49151675e+00,  1.60961185e+00,
       -7.21489545e-01, -1.00364615e+00,  3.71477442e-01,  1.04338916e-01,
       -1.95656997e+00,  1.25593513e+00,  1.05298108e+00, -1.37385038e-01,
        2.05410238e-01,  7.82307068e-01,  1.27633288e+00,  5.30640791e-02,
        7.99984245e-01,  7.05395981e-02, -1.79543826e-01,  4.73514911e-01,
        6.00450774e-01, -8.61330227e-01,  4.23563115e-01, -3.16187951e-01,
        5.29125909e-01, -1.61386100e-01, -5.03906445e-01,  7.76164245e-02,
        9.16675324e-01, -2.43612097e+00,  9.52855462e-01, -1.37659340e+00,
        4.95151260e-01, -5.66757894e-01,  7.89773866e-01,  1.56966435e-01,
       -1.50005020e+00, -9.30381830e-01,  2.18791102e-01,  1.73610693e+00,
       -1.22926673e+00,  6.96261051e-01,  1.94864693e+00, -4.14306024e-01,
        1.91226913e-01, -9.44693143e-01, -7.76657836e-01,  2.37511882e-01,
        5.25412261e-01, -5.55161589e-01, -1.19005631e-01, -9.14182010e-01,
        4.34153772e-01,  2.41016036e+00,  4.02913624e-01, -4.63867562e-01,
       -8.74411339e-01, -1.27469584e+00, -1.68077046e-01,  2.57170860e-01,
        9.51486985e-01, -7.81040531e-01, -1.50227872e+00, -4.27590261e-01,
       -6.03908395e-01, -9.17456691e-01, -2.93682266e-01, -1.45066342e+00,
        4.78331518e-01, -7.15833230e-01, -4.78694734e-01,  1.03078299e+00,
        1.12148695e+00, -1.52029607e+00,  6.21823286e-02, -6.16844236e-01,
       -5.40184201e-01,  4.09794756e-01, -2.98286061e-01, -4.92581781e-01,
        5.69362488e-01,  9.73567833e-01,  2.33849926e-01,  1.24425430e+00,
       -1.30389911e+00, -4.86776547e-01, -9.45421360e-01,  1.50787904e+00,
       -1.04373336e+00, -3.10635248e-01, -1.18140847e+00, -7.25317145e-01,
       -7.36769714e-01, -1.13798849e+00,  3.17155113e-01,  2.57042107e+00,
       -1.29981194e+00,  1.08613123e+00,  5.82760096e-01, -1.97456854e+00,
       -8.04459670e-01, -7.28371018e-01, -4.85448229e-01, -1.73256355e+00,
       -1.50976900e-01,  3.50704024e-01,  1.41682856e-01,  2.57276989e-01,
       -3.50561474e-01, -1.09777142e+00, -6.07798190e-01, -5.10980202e-01,
       -2.45237410e-01, -3.58022517e-01, -1.41585655e+00,  1.47007264e+00,
       -2.07831116e+00,  1.56078461e+00, -4.01709489e-01,  2.10305308e-02,
       -7.63322218e-01,  2.30514220e-01,  5.54917896e-01, -1.48639754e+00,
        1.96536394e+00,  8.64256074e-01, -3.27648760e-01, -1.58455789e-01,
        9.12542393e-01,  1.23884269e+00,  1.40181937e+00, -5.92109004e-01,
       -1.28901783e+00,  8.63065626e-01,  1.83557673e+00,  8.35987632e-01,
        1.28991158e+00, -5.14864051e-01, -6.81245997e-01,  3.94707188e-01,
        7.97737686e-01, -1.51217051e-01,  1.68988582e-01, -1.51327079e+00,
       -1.24188746e+00, -2.78045275e-02, -1.40706049e-01, -1.65478064e+00,
        2.26693981e+00, -8.46231816e-01,  2.88498678e-01, -1.13909828e+00,
       -6.20126799e-01, -7.59815444e-01, -4.10459783e-01, -1.12309064e+00,
       -1.11672780e+00,  1.74946648e+00,  9.41882008e-01,  1.84025614e+00,
       -1.01905898e+00,  1.31175881e+00, -5.28063776e-01, -2.21406763e+00,
       -2.08770306e-01,  1.59279243e+00,  8.47662775e-03, -5.20178478e-01,
        1.33847625e+00, -1.10387021e+00,  5.98110860e-01,  7.33888912e-01,
       -8.11076807e-01, -1.31529733e+00,  5.15103925e-02,  3.89111045e-01,
       -2.68486621e-01, -3.68694169e-01, -1.07548875e+00, -1.22317648e+00,
       -1.34332624e+00, -4.76053342e-02,  3.01517741e-01,  7.87250881e-01,
        1.32511622e+00, -6.32393437e-01,  3.74398437e-01, -7.96169300e-01,
       -1.03706708e+00,  2.18639720e+00, -2.99250976e-01,  1.24271628e+00,
       -7.57865515e-01, -4.66741742e-02, -5.63442798e-01,  1.40847007e+00,
        3.56107733e-01,  1.91108145e-01,  3.62517612e-02,  7.41631698e-01,
       -1.56332101e+00,  3.92914329e-01,  8.10401520e-01,  4.19484645e-01,
       -5.33277121e-01, -3.00931632e-01,  8.31447376e-01,  1.65725758e+00,
        1.34037725e+00,  6.71658717e-02, -9.16029801e-02,  2.18903640e+00,
        9.65971428e-01,  2.16766280e-01, -5.61050644e-01, -1.75517079e+00,
        4.33094251e-01,  1.61295067e+00,  1.32366329e+00,  1.80546097e+00,
       -1.03321383e+00, -6.82177830e-02, -9.61435446e-01, -1.24919692e+00,
        3.46450491e-01,  9.82517594e-02, -2.02412538e-01, -6.62723184e-01,
       -3.59121204e-01,  5.14323500e-01, -6.77379293e-01,  7.33230981e-01,
       -8.53436522e-01, -5.01876470e-03,  1.72664720e+00, -1.58923683e-01,
       -3.20509350e-01, -4.93694517e-01, -9.08063598e-01, -1.70945478e-01,
        9.26545995e-01,  8.61670449e-02,  1.58748811e+00, -2.47662773e+00,
        1.98274887e-01,  2.99051215e-01, -1.36408594e-01,  1.65427621e+00,
       -2.41175943e-01, -2.06686016e-01,  1.84900482e+00,  2.00851126e-01,
       -5.51962835e-01,  2.20521786e+00,  1.46153050e+00, -1.38104660e+00,
        7.93993474e-02, -5.79994923e-02, -3.68394436e-01,  9.29958292e-01,
        1.17107488e+00,  4.12913994e-01,  1.31724970e+00,  1.06140498e+00,
        4.27742103e-01, -9.54484361e-01,  5.47153196e-01,  2.75872088e+00,
        1.59679359e+00,  4.08427018e-01, -5.21095894e-01,  7.23541998e-01,
       -5.18622802e-01, -1.32425914e+00, -1.01183667e-01, -1.02455569e+00,
        7.90070331e-01, -5.03608381e-01,  6.75578498e-01,  5.59808953e-01,
        1.02538202e+00,  9.74661583e-02, -1.39385297e+00, -4.59895680e-01,
        6.26215418e-01,  8.80501834e-02, -3.94435133e-02,  7.84999062e-02,
       -6.84659508e-01, -9.29107983e-01,  1.98236593e+00,  2.27921045e-01,
       -1.17310293e+00, -3.19109260e-01, -3.21079234e-01,  1.16087887e+00,
        9.33720515e-01,  2.31426463e-01,  2.02126459e+00,  5.11742188e-01,
       -3.49105292e-02, -5.90862501e-01,  1.10242567e+00,  4.74139131e-01,
        1.06579319e+00, -4.95793061e-01, -9.22173234e-01,  2.09851006e+00,
        4.10698834e-01,  6.69594469e-02, -1.48797431e+00, -4.34731983e-01,
       -2.39655187e-01,  3.55199587e-01,  1.47530000e+00, -9.76126962e-01,
        9.71496199e-01, -4.41630184e-01,  9.98149412e-01,  3.26822565e-01,
        5.28060387e-02, -5.41307786e-01,  1.84100117e-01, -1.92405720e+00,
        1.14076743e+00, -3.50165651e-01, -6.98759588e-01,  9.42061668e-02,
       -2.34509335e-01,  7.94536579e-01, -9.24230382e-01,  2.03770021e+00,
        5.84358738e-01, -8.68684964e-01,  1.72627968e+00, -1.15808126e+00,
       -4.24892206e-01, -6.00161701e-01, -2.00306692e+00,  1.67422710e-01,
        7.34539457e-01,  3.73967132e-02,  1.04375968e+00,  7.30656279e-01,
        5.65017818e-01,  5.48592343e-01,  2.24577440e+00,  2.69489530e-01,
        2.38397278e-01, -9.97654718e-01, -4.78863313e-01, -1.53006930e+00,
        8.56319667e-01, -1.04745160e+00,  5.61225492e-01,  9.83269265e-01,
       -7.65083656e-01,  2.93076293e-01,  2.19511739e+00, -7.62529616e-02,
       -5.22699076e-01, -1.53997628e+00, -7.42277068e-01, -1.65593556e+00,
       -2.24250111e+00, -1.55128273e+00, -3.31559388e-01,  1.00166412e+00,
        1.01788073e+00,  1.49034298e+00, -7.27622050e-02, -5.88213466e-01,
        8.21118964e-01, -9.79028828e-02,  1.12662027e+00, -4.43138477e-01,
        1.43309938e-01,  4.96167650e-01, -9.10098484e-01, -8.93589698e-01,
       -4.05300640e-02, -4.05562812e-01,  4.85808263e-01,  1.17032703e+00,
       -7.42876363e-01, -7.41971252e-01, -7.13145142e-01,  1.59239000e+00,
       -1.26807240e+00, -1.04222678e-01, -2.10993946e+00,  1.90558162e+00,
       -5.10313616e-01, -6.67404372e-03, -5.26320740e-02, -3.32700623e-01,
       -6.62699038e-01, -8.61547050e-01,  2.25284647e+00, -1.41196189e+00,
       -1.50453156e-01, -1.24304129e+00, -8.06532530e-02, -5.11122237e-01,
        4.25484742e-01, -1.25753140e+00,  3.88575809e-01,  1.34189961e+00,
       -1.34605631e+00, -6.99131360e-01,  6.60669933e-01, -3.93974648e-01,
       -8.11197450e-01,  5.41353354e-01,  1.69276637e+00, -9.75859153e-01,
       -7.29719076e-01,  2.44697760e-01, -1.21414532e-01, -6.24854567e-01,
        9.05522612e-01, -6.98223354e-01,  6.32687843e-01,  2.44884960e-01,
       -1.54758233e+00,  4.95332487e-01,  1.05767871e+00, -2.28522827e+00,
       -2.24163242e-01,  1.05360148e+00, -1.19708574e-01, -2.08216241e+00,
       -1.85831486e+00,  7.37859376e-01, -7.79366828e-01, -1.28372043e+00,
        2.91049318e-01,  1.03898143e-01, -1.79964521e+00, -8.32665604e-01,
        4.51094203e-01,  7.16064619e-01, -1.25620664e+00,  1.80791945e-01,
       -8.03796642e-01, -8.28879200e-01,  5.97524118e-01,  2.55212665e+00,
        5.02718301e-01, -1.38734448e+00, -1.01497659e+00,  6.05933581e-01,
        1.22431007e+00, -1.16542889e+00, -7.10308651e-01, -2.69241328e+00,
       -6.48276734e-01,  1.33920178e+00, -4.76851615e-01,  7.76656177e-01,
        2.97800740e-01, -1.24426827e-01,  1.27279626e+00,  1.21570543e-01,
       -4.45132045e-01, -8.99387785e-01, -9.57998559e-01, -4.12841877e-01,
        2.34167380e-01, -6.11340843e-01,  1.00876368e-02,  2.51394468e-01,
        6.93855522e-01, -7.96369185e-01,  7.87250897e-01, -1.37295030e+00,
        1.09727651e+00, -1.36831481e-01, -1.06402254e+00, -1.27376029e+00,
        2.21233177e+00,  4.87498689e-01,  2.74618211e-01, -5.07893562e-01,
       -5.41642700e-01, -5.70064675e-01, -3.37986523e-01,  5.35360820e-01,
        4.73658792e-02,  9.26399469e-01,  6.36300765e-01, -9.09705443e-01,
       -5.93902748e-01,  6.54811507e-01,  4.17938945e-01,  1.27758059e+00,
       -8.92806142e-02,  9.64043228e-01,  1.88402216e+00, -1.54552159e+00,
        1.38354361e-01,  1.86500375e-01, -7.04309562e-01, -6.44951935e-01,
        1.64614001e+00, -8.81568184e-01,  3.18550458e-01, -9.27915139e-01,
        3.99148196e-01,  5.21464967e-01,  3.13073851e+00,  2.09046431e+00,
        5.78412576e-01,  8.11782624e-01,  2.55112358e-01,  1.21613533e-01,
        5.26537413e-01, -2.22479248e-01, -3.02301349e-01,  1.39384479e-01,
        1.80353961e+00, -6.59950802e-01, -9.98357313e-01, -3.47850647e-02,
        6.51932160e-01,  2.90054441e-01,  1.24989675e+00,  1.02809417e+00,
        5.57568469e-01,  1.31385986e+00, -1.79475396e+00,  2.01191665e+00,
        1.27837409e+00, -5.13243960e-02, -1.34373083e-01, -7.61934688e-01,
       -1.49600922e+00, -4.37866169e-01,  1.63828131e+00,  2.47341988e-03])

In [141]:
cats = pd.qcut(data, 4) # разложить на 4 квартиля

In [142]:
cats

[(-0.686, 0.00928], (-0.686, 0.00928], (0.654, 3.131], (0.00928, 0.654], (-0.686, 0.00928], ..., (-3.295, -0.686], (-3.295, -0.686], (-0.686, 0.00928], (0.654, 3.131], (-0.686, 0.00928]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.295, -0.686] < (-0.686, 0.00928] < (0.00928, 0.654] < (0.654, 3.131]]

In [145]:
pd.value_counts(data)

-0.469600    1
 2.189036    1
 0.036252    1
 0.741632    1
-1.563321    1
            ..
 0.211475    1
 0.941275    1
-1.923112    1
-0.281976    1
 0.002473    1
Length: 1000, dtype: int64

In [147]:
pd.value_counts(cats) # получились ящики равного размера

(-3.295, -0.686]     250
(-0.686, 0.00928]    250
(0.00928, 0.654]     250
(0.654, 3.131]       250
dtype: int64

In [149]:
# Как и в случае с cut, можно задать величины квантилей (числа от 0 до 1 включительно) самостояльно.

pd.qcut(data, [0.1, 0.5, 1])

[(-1.301, 0.00928], (-1.301, 0.00928], (0.00928, 3.131], (0.00928, 3.131], (-1.301, 0.00928], ..., (-1.301, 0.00928], NaN, (-1.301, 0.00928], (0.00928, 3.131], (-1.301, 0.00928]]
Length: 1000
Categories (2, interval[float64, right]): [(-1.301, 0.00928] < (0.00928, 3.131]]

In [153]:
pd.qcut(data, [0.1, 0.5, 1], precision=2) # разделили на 2 квантиля, с точность 2 знака после запятой

[(-1.31, 0.0093], (-1.31, 0.0093], (0.0093, 3.13], (0.0093, 3.13], (-1.31, 0.0093], ..., (-1.31, 0.0093], NaN, (-1.31, 0.0093], (0.0093, 3.13], (-1.31, 0.0093]]
Length: 1000
Categories (2, interval[float64, right]): [(-1.31, 0.0093] < (0.0093, 3.13]]

#  Обнаружение и фильтрация выбросов

In [154]:
# Фильтрация или преобразование выбросов - это в основном вопрос применений операций с массивами.
# Рассмотрим объект DataFrame с нормально распредленными данными:

data = pd.DataFrame(np.random.randn(1000, 4))

In [157]:
data.describe() # выводим основные характеристики

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.030914    -0.017568     0.049768    -0.005089
std       0.980377     0.975890     1.009842     1.018369
min      -2.766906    -3.212827    -2.875385    -2.848427
25%      -0.610648    -0.687390    -0.642808    -0.721871
50%       0.032861    -0.008696     0.045390    -0.008081
75%       0.661420     0.627247     0.748726     0.694197
max       3.637450     3.522305     3.712560     3.813253

In [162]:
# К примеру, мы хотим найти в одном из столбцов значения, превышающие 3 по абсолютной величине:

data[np.abs(data[2])>3]

            0         1         2         3
92  -0.635327  0.822076  3.712560  2.753917
315 -0.806060 -0.982441  3.001587  0.540327

In [163]:
data[2]

0      1.766738
1      0.251987
2     -0.534323
3     -1.672575
4     -0.483766
         ...
995    1.012507
996   -0.762735
997   -0.684927
998    0.774774
999    1.669527
Name: 2, Length: 1000, dtype: float64

In [172]:
# Чтобы выбрать все строки, в которых встречаются значения, по абсолютной величине превышающие 3,  мы можем
# воспользоваться методом any() для булева объекта DataFrame:

pd.value_counts((abs(data) > 3).any(1)) # к примеру, найдено всего 8 строк, где хотя бы 3 встречается один раз

False    992
True       8
dtype: int64

In [176]:
data[(abs(data) > 3).any(1)] # вот так получил все эти строки

            0         1         2         3
92  -0.635327  0.822076  3.712560  2.753917
291  3.637450 -0.182368 -0.094358 -0.916370
315 -0.806060 -0.982441  3.001587  0.540327
329  0.022582  3.036304 -0.179955  2.284693
465  3.046888 -0.204092 -1.381181  1.338257
735  0.009514 -2.272799  0.387282  3.813253
802 -2.063097 -3.212827 -0.343538  1.709346
928 -0.065738  3.522305  1.168084 -0.270248

In [177]:
# Говорят, есть такая функция np.sign() которая возвращает 1, если значений положительно, и -1 иначе

In [178]:
np.sign(1)

1

In [180]:
np.sign(0) # так, то есть он вернет 0, если число равно 0

0

In [181]:
np.sign(-14)

-1

In [182]:
np.sign(data)

       0    1    2    3
0    1.0  1.0  1.0  1.0
1   -1.0 -1.0  1.0  1.0
2   -1.0  1.0 -1.0 -1.0
3    1.0 -1.0 -1.0 -1.0
4   -1.0  1.0 -1.0 -1.0
..   ...  ...  ...  ...
995  1.0  1.0  1.0 -1.0
996  1.0 -1.0 -1.0  1.0
997 -1.0  1.0 -1.0 -1.0
998 -1.0 -1.0  1.0 -1.0
999  1.0 -1.0  1.0  1.0

[1000 rows x 4 columns]

In [187]:
# Хорошо, допустим я хочу присвоить значения данным, удолетворяющим критерию с тройкой выше. 
# И хочу, чтобы мы срезали числа больше 3 или -3, то есть числа выходящие за -3 < x < 3

data[np.abs(data) > 3] = np.sign(data) *3

In [189]:
data # и тут те элементы, которые выходили за интервал изменились на 3 и -3!!!!!офигенно!!!

            0         1         2         3
0    1.258326  0.343776  1.766738  0.675802
1   -2.158695 -0.352173  0.251987  0.923038
2   -0.070352  0.060426 -0.534323 -0.429362
3    0.479370 -0.075717 -1.672575 -0.864015
4   -0.076146  1.056585 -0.483766 -0.059345
..        ...       ...       ...       ...
995  0.579311  2.179021  1.012507 -0.615755
996  0.567124 -0.259038 -0.762735  1.470420
997 -0.489562  0.068928 -0.684927 -1.554137
998 -0.001705 -0.687284  0.774774 -0.382204
999  1.256526 -0.560860  1.669527  1.021375

[1000 rows x 4 columns]

# Перестановки и случайная выборка

In [2]:
# Переставить (случайным образом переупорядочить) объект Series или DataFrame легко с помощью функции
# np.random.permutation . Если передать функции permutation длину оси, для которой производится перестановка,
# то будет возвращен массив целых чисел, описывающий новый порядок

In [3]:
df = pd.DataFrame(np.arange(20).reshape(5, 4))
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [5]:
np.random.permutation(df) # так он просто переставил строки в случайном порядке

array([[ 8,  9, 10, 11],
       [ 4,  5,  6,  7],
       [12, 13, 14, 15],
       [16, 17, 18, 19],
       [ 0,  1,  2,  3]])

In [13]:
np.random.permutation(7) # берет 7 случайных чисел из матрицы

array([5, 1, 0, 4, 3, 6, 2])

In [14]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [17]:
df.sample(n=3) # выбор случайного подмножества без возвращения

    0   1   2   3
4  16  17  18  19
0   0   1   2   3
3  12  13  14  15

In [18]:
# Что бы сгенерировать выборку с возвращением (когда разрешается выбрать один и тот же объект несколько раз),
# нужно просто передать методу sample аргумент replace=True

In [19]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [24]:
df.sample(n=5, replace=True) # с возвращением (последняя строка 2 раза повторяется)

    0   1   2   3
2   8   9  10  11
2   8   9  10  11
0   0   1   2   3
3  12  13  14  15
0   0   1   2   3

# Вычисление индикаторных переменных

In [25]:
# Еще одно преобразование, встречающееся в статистическом моделировании и машинном обучении это преобразование
# категориальной переменной в фиктивную, или индикаторную, матрицу. Если в столбце DataFrame встречается
# k различных значений, то можно построить матрицу или объект DataFrame c  k столбцами, содержащие только
# нули и единицы. В бибилиотеке pandas для этого имеется функция get_dummies

In [2]:
df = pd.DataFrame({'key' : list('bbacab'), 'data1' : range(6)})

In [27]:
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [32]:
pd.get_dummies(df['key']) # то есть этот метод берет опеределенный столбец и строит матрицу смежности для
# элементов этого столбца

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [6]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [7]:
# Иногда желательно добавить префикс к столбцам индикаторного объекта DataFrame, который затем можно слить с
# другими данными. У функции get_dummies для этой цели предусмотрен аргумент prefix:

In [8]:
# dummies переводится как кукла!!!

In [9]:
dummies = pd.get_dummies(df['key'], prefix='key')

In [11]:
dummies # исползовали префикс для индикаторного столбца

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [19]:
# а давай объединим его с другим столбцом

df_with_dum = df[['data1']].join(dummies) # но только почему двойные скобки...хм

In [18]:
df_with_dum

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [23]:
df[['data1']] # то есть так через двойные скобки мы получает нормальный объект DataFrame, а иначе Series

   data1
0      0
1      1
2      2
3      3
4      4
5      5

In [24]:
# Если некоторая строка DataFrame принадлежит нескольким категориям, то ситуация немного усложняется. Рассмотрим
# набор данных:

In [28]:
mnames = ['movie_id', 'title', 'genres']

movies = pd.read_table('/home/alex/Документы/pydata-book-2nd-edition/datasets/movielens/movies.dat', sep='::', header=None, names=mnames)

In [29]:
movies

,movie_id,title,genres
0,1,Toy Story (1995),Animation|Children's|Comedy
1,2,Jumanji (1995),Adventure|Children's|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama
4,5,Father of the Bride Part II (1995),Comedy
...,...,...,...
3878,3948,Meet the Parents (2000),Comedy
3879,3949,Requiem for a Dream (2000),Drama
3880,3950,Tigerland (2000),Drama
3881,3951,Two Family House (2000),Drama
3882,3952,"Contender, The (2000)",Drama|Thriller

In [30]:
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [31]:
# Чтобы добавить индикаторные переменные для каждого жанра, данные придется немного переформатировать.
# Сначала построим список уникальных жанров, встречающихся в наборе данных.

In [32]:
# genres = жанры

In [33]:
all_genres = []

for x in movies['genres']:
    all_genres.extend(x.split('|'))

In [35]:
all_genres #  получили список, здесь много всего повторяется, превратим тогда в множество

['Animation',
 "Children's",
 'Comedy',
 'Adventure',
 "Children's",
 'Fantasy',
 'Comedy',
 'Romance',
 'Comedy',
 'Drama',
 'Comedy',
 'Action',
 'Crime',
 'Thriller',
 'Comedy',
 'Romance',
 'Adventure',
 "Children's",
 'Action',
 'Action',
 'Adventure',
 'Thriller',
 'Comedy',
 'Drama',
 'Romance',
 'Comedy',
 'Horror',
 'Animation',
 "Children's",
 'Drama',
 'Action',
 'Adventure',
 'Romance',
 'Drama',
 'Thriller',
 'Drama',
 'Romance',
 'Thriller',
 'Comedy',
 'Action',
 'Action',
 'Comedy',
 'Drama',
 'Crime',
 'Drama',
 'Thriller',
 'Thriller',
 'Drama',
 'Sci-Fi',
 'Drama',
 'Romance',
 'Drama',
 'Drama',
 'Romance',
 'Adventure',
 'Sci-Fi',
 'Drama',
 'Drama',
 'Drama',
 'Sci-Fi',
 'Adventure',
 'Romance',
 "Children's",
 'Comedy',
 'Drama',
 'Drama',
 'Romance',
 'Drama',
 'Documentary',
 'Comedy',
 'Comedy',
 'Romance',
 'Drama',
 'Drama',
 'War',
 'Action',
 'Crime',
 'Drama',
 'Drama',
 'Action',
 'Adventure',
 'Comedy',
 'Drama',
 'Drama',
 'Romance',
 'Crime',
 'Thriller',
 'Animation',
 "Children's",
 'Musical',
 'Romance',
 'Drama',
 'Romance',
 'Crime',
 'Thriller',
 'Action',
 'Drama',
 'Thriller',
 'Comedy',
 'Drama',
 "Children's",
 'Comedy',
 'Drama',
 'Adventure',
 "Children's",
 'Fantasy',
 'Drama',
 'Drama',
 'Romance',
 'Drama',
 'Mystery',
 'Adventure',
 "Children's",
 'Fantasy',
 'Drama',
 'Thriller',
 'Drama',
 'Comedy',
 'Comedy',
 'Romance',
 'Comedy',
 'Sci-Fi',
 'Thriller',
 'Drama',
 'Comedy',
 'Romance',
 'Comedy',
 'Action',
 'Comedy',
 'Crime',
 'Horror',
 'Thriller',
 'Action',
 'Comedy',
 'Drama',
 'Drama',
 'Musical',
 'Drama',
 'Romance',
 'Comedy',
 'Drama',
 'Sci-Fi',
 'Thriller',
 'Documentary',
 'Drama',
 'Drama',
 'Thriller',
 'Drama',
 'Crime',
 'Drama',
 'Romance',
 'Drama',
 'Drama',
 'Comedy',
 'Drama',
 'Drama',
 'Romance',
 'Adventure',
 'Drama',
 "Children's",
 'Comedy',
 'Comedy',
 'Action',
 'Thriller',
 'Drama',
 'Drama',
 'Thriller',
 'Comedy',
 'Romance',
 'Drama',
 'Action',
 'Thriller',
 'Comedy',
 'Drama',
 'Action',
 'Thriller',
 'Documentary',
 'Drama',
 'Thriller',
 'Comedy',
 'Comedy',
 'Thriller',
 'Comedy',
 'Drama',
 'Romance',
 'Comedy',
 'Drama',
 'Adventure',
 "Children's",
 'Comedy',
 'Musical',
 'Documentary',
 'Comedy',
 'Action',
 'Drama',
 'War',
 'Drama',
 'Thriller',
 'Action',
 'Adventure',
 'Crime',
 'Drama',
 'Mystery',
 'Drama',
 'Comedy',
 'Documentary',
 'Crime',
 'Comedy',
 'Romance',
 'Comedy',
 'Drama',
 'Drama',
 'Comedy',
 'Romance',
 'Drama',
 'Mystery',
 'Romance',
 'Drama',
 'Comedy',
 'Adventure',
 "Children's",
 'Fantasy',
 'Drama',
 'Documentary',
 'Comedy',
 'Romance',
 'Drama',
 'Drama',
 'Romance',
 'Thriller',
 'Comedy',
 'Drama',
 'Documentary',
 'Comedy',
 'Documentary',
 'Documentary',
 'Drama',
 'Action',
 'Drama',
 'Drama',
 'Romance',
 'Comedy',
 'Drama',
 'Drama',
 'Comedy',
 'Action',
 'Adventure',
 "Children's",
 'Drama',
 'Drama',
 'Crime',
 'Drama',
 'Thriller',
 'Drama',
 'Drama',
 'Romance',
 'War',
 'Horror',
 'Action',
 'Adventure',
 'Comedy',
 'Crime',
 'Drama',
 'Drama',
 'War',
 'Comedy',
 'Comedy',
 'War',
 'Adventure',
 "Children's",
 'Drama',
 'Action',
 'Adventure',
 'Mystery',
 'Sci-Fi',
 'Drama',
 'Thriller',
 'War',
 'Documentary',
 'Action',
 'Romance',
 'Thriller',
 'Crime',
 'Film-Noir',
 'Mystery',
 'Thriller',
 'Action',
 'Thriller',
 'Comedy',
 'Drama',
 'Drama',
 'Action',
 'Adventure',
 'Drama',
 'Romance',
 'Adventure',
 "Children's",
 'Drama',
 'Action',
 'Crime',
 'Thriller',
 'Comedy',
 'Action',
 'Sci-Fi',
 'Thriller',
 'Action',
 'Adventure',
 'Sci-Fi',
 'Comedy',
 'Drama',
 'Comedy',
 'Horror',
 'Comedy',
 'Drama',
 'Romance',
 'Comedy',
 'Action',
 "Children's",
 'Drama',
 'Romance',
 'Thriller',
 'Drama',
 'Sci-Fi',
 'Thriller',
 'Comedy',
 'Comedy',
 'Horror',
 'Comedy',
 'Thriller',
 'Drama',
 'Documentary',
 'Drama',
 'Drama',
 'Comedy',
 'Drama',
 'Romance',
 'Horror',
 'Sci-Fi',
 'Drama',
 'Action',
 'Crime',
 'Sci-Fi',
 'Drama',
 'Musical',
 'Thriller',
 'Drama',
 'Drama',
 'Romance',
 'Comedy',
 'Action',
 'Comedy',
 'Drama',
 'Documentary',
 'Drama',
 'Romance',
 'Action',
 'Adventure',
 'Drama',
 'Western',
 'Drama',
 'Comedy',
 'Drama',
 'Drama',
 'Drama',
 'Romance',
 'Comedy',
 'Drama',
 'Thriller',
 'Comedy',
 'Drama',
 'Drama',
 'Horror',
 'Drama',
 'Romance',
 'Comedy',
 'Comedy',
 'Drama',
 'Romance',
 'Drama',
 'Thriller',
 'Thriller',
 'Action',
 'Comedy',
 'Drama',
 'Thriller',
 'Drama',
 'Thriller',
 'Comedy',
 'Comedy',
 'Drama',
 'Drama',
 'Comedy',
 'Comedy',
 'Drama',
 'Comedy',
 'Romance',
 'Comedy',
 'Romance',
 'Adventure',
 "Children's",
 'Animation',
 "Children's",
 'Comedy',
 'Romance',
 'Thriller',
 "Children's",
 'Drama',
 'Drama',
 'Musical',
 'Comedy',
 'Animation',
 "Children's",
 'Crime',
 'Drama',
 'Documentary',
 'Drama',
 'Fantasy',
 'Romance',
 'Thriller',
 'Comedy',
 'Drama',
 'Romance',
 "Children's",
 'Comedy',
 'Action',
 'Comedy',
 'Romance',
 'Drama',
 'Horror',
 'Drama',
 'Comedy',
 'Comedy',
 'Sci-Fi',
 'Mystery',
 'Thriller',
 'Adventure',
 "Children's",
 'Comedy',
 'Fantasy',
 'Romance',
 'Crime',
 'Drama',
 'Thriller',
 'Action',
 'Adventure',
 'Fantasy',
 'Sci-Fi',
 'Drama',
 "Children's",
 'Drama',
 'Drama',
 'Drama',
 'Drama',
 'Romance',
 'Drama',
 'Romance',
 'War',
 'Western',
 'Comedy',
 'Drama',
 'Drama',
 'Drama',
 'Romance',
 'Drama',
 'Drama',
 'Drama',
 'Horror',
 'Comedy',
 'Comedy',
 'Comedy',
 'Romance',
 'Drama',
 'Comedy',
 'Drama',
 'Drama',
 'Thriller',
 'Drama',
 'Drama',
 'Crime',
 'Drama',
 'Action',
 'Crime',
 'Drama',
 'Horror',
 'Action',
 'Sci-Fi',
 'Thriller',
 'Comedy',
 'Romance',
 'Action',
 'Thriller',
 'Comedy',
 'Romance',
 'Crime',
 'Drama',
 'Thriller',
 'Action',
 'Drama',
 'Thriller',
 'Crime',
 'Drama',
 'Romance',
 'Thriller',
 'Comedy',
 'Romance',
 'Comedy',
 'Romance',
 'Crime',
 'Drama',
 'Drama',
 'Comedy',
 'Drama',
 'Drama',
 'Drama',
 'Romance',
 'Drama',
 'Romance',
 'Action',
 'Adventure',
 'Western',
 'Comedy',
 'Drama',
 'Comedy',
 'Drama',
 'Drama',
 'Drama',
 'Drama',
 'Comedy',
 'Horror',
 'Thriller',
 'Comedy',
 'Animation',
 "Children's",
 'Drama',
 'Action',
 'Action',
 'Adventure',
 'Sci-Fi',
 "Children's",
 'Comedy',
 'Fantasy',
 'Drama',
 'Thriller',
 'Film-Noir',
 'Thriller',
 'Drama',
 'Comedy',
 'Drama',
 'Comedy',
 'Comedy',
 'Drama',
 'Action',
 'Comedy',
 'Musical',
 'Sci-Fi',
 'Horror',
 'Action',
 'Adventure',
 'Sci-Fi',
 'Comedy',
 'Horror',
 'Drama',
 'Horror',
 'Sci-Fi',
 'Comedy',
 'Drama',
 'Mystery',
 'Thriller',
 'Drama',
 'War',
 'Drama',
 'Sci-Fi',
 'Thriller',
 'Comedy',
 'Romance',
 'Adventure',
 'Drama',
 'Drama',
 'Comedy',
 'Romance',
 "Children's",
 'Comedy',
 'Comedy',
 'Drama',
 'Drama',
 'Musical',
 'Drama',
 'Comedy',
 'Action',
 'Adventure',
 'Thriller',
 'Drama',
 'Mystery',
 'Thriller',
 'Comedy',
 'Drama',
 'Romance',
 'Comedy',
 'Action',
 'Romance',
 'Thriller',
 'Drama',
 "Children's",
 'Comedy',
 'Comedy',
 'Romance',
 'War',
 'Comedy',
 'Romance',
 'Drama',
 'Comedy',
 'Drama',
 'Romance',
 'Action',
 'Comedy',
 'Drama',
 'Romance',
 'Adventure',
 "Children's",
 'Romance',
 'Documentary',
 'Animation',
 "Children's",
 'Musical',
 'Drama',
 'Horror',
 'Comedy',
 'Crime',
 'Fantasy',
 'Action',
 'Comedy',
 'Western',
 'Drama',
 'Comedy',
 'Comedy',
 'Drama',
 'Comedy',
 'Drama',
 'Thriller',
 "Children's",
 'Comedy',
 'Drama',
 'Action',
 'Thriller',
 'Action',
 'Romance',
 'Thriller',
 'Comedy',
 'Romance',
 'Action',
 'Sci-Fi',
 'Action',
 'Adventure',
 'Comedy',
 'Romance',
 'Drama',
 'Drama',
 'Horror',
 'Western',
 'Action',
 'Drama',
 'Drama',
 'Action',
 'Comedy',
 'Drama',
 'Drama',
 'Romance',
 'War',
 'Action',
 'Comedy',
 'Drama',
 'Crime',
 'Drama',
 'Adventure',
 "Children's",
 'Action',
 'Action',
 'Drama',
 'Drama',
 'Horror',
 'Documentary',
 'Drama',
 'Drama',
 'Action',
 'Thriller',
 'Comedy',
 'Comedy',
 'Crime',
 'Drama',
 'Documentary',
 'Action',
 'Sci-Fi',
 'Drama',
 'Horror',
 'Thriller',
 'Drama',
 'Drama',
 'Comedy',
 'Comedy',
 'Drama',
 'Comedy',
 'Comedy',
 'Comedy',
 'Thriller',
 'Western',
 'Comedy',
 'Romance',
 'Drama',
 'Comedy',
 'Action',
 'Comedy',
 'Adventure',
 "Children's",
 'Thriller',
 'Action',
 'Thriller',
 'Drama',
 'Drama',
 'Romance',
 'Horror',
 'Sci-Fi',
 'Thriller',
 'Mystery',
 'Romance',
 'Thriller',
 'Drama',
 'Comedy',
 'Drama',
 'Crime',
 'Drama',
 'Comedy',
 'Western',
 'Comedy',
 'Action',
 'Adventure',
 'Crime',
 'Comedy',
 'Sci-Fi',
 'Drama',
 'Thriller',
 'Comedy',
 'Action',
 'Comedy',
 'Drama',
 'Comedy',
 'Romance',
 'Comedy',
 'Action',
 'Sci-Fi',
 'Documentary',
 'Comedy',
 'Romance',
 'Comedy',
 'Drama',
 'Romance',
 'Comedy',
 'Romance',
 'Drama',
 'Comedy',
 'Comedy',
 'Drama',
 'Drama',
 'Mystery',
 'Romance',
 'Drama',
 'Comedy',
 'Drama',
 'Thriller',
 'Adventure',
 "Children's",
 'Drama',
 'Drama',
 'Action',
 'Thriller',
 'Drama',
 'Western',
 'Action',
 'Comedy',
 'Drama',
 'Romance',
 'Action',
 'Adventure',
 'Crime',
 'Drama',
 'Thriller',
 'Action',
 'Adventure',
 'Crime',
 'Thriller',
 'Action',
 'Drama',
 'War',
 'Action',
 'Comedy',
 'War',
 'Comedy',
 'Comedy',
 'Romance',
 'Drama',
 'Romance',
 'Comedy',
 'Comedy',
 'Romance',
 'Comedy',
 'Drama',
 'Comedy',
 'War',
 'Action',
 'Thriller',
 'Drama',
 'Comedy',
 'Drama',
 'Drama',
 'Comedy',
 'Action',
 'Action',
 'Adventure',
 'Sci-Fi',
 'Drama',
 'Thriller',
 'Thriller',
 'Drama',
 'Adventure',
 "Children's",
 'Action',
 'Comedy',
 'Comedy',
 'Comedy',
 'Western',
 'Drama',
 'Comedy',
 'Thriller',
 'Drama',
 'Comedy',
 'Mystery',
 'Action',
 'Crime',
 'Drama',
 'Action',
 'Thriller',
 'Drama',
 'Comedy',
 'Drama',
 'Romance',
 'Comedy',
 'Romance',
 'Drama',
 'Romance',
 'Comedy',
 'Romance',
 'Comedy',
 'Drama',
 'Action',
 "Children's",
 'Drama',
 'Action',
 'Sci-Fi',
 'Comedy',
 'Drama',
 'Action',
 'Drama',
 'Drama',
 'Drama',
 'Romance',
 'Drama',
 'Action',
 'Drama',
 'Horror',
 'Sci-Fi',
 'Comedy',
 'Mystery',
 'Romance',
 'Comedy',
 'Drama',
 'Comedy',
 'Drama',
 'War',
 'Action',
 'Drama',
 'Mystery',
 'Comedy',
 'Sci-Fi',
 'Thriller',
 'Comedy',
 'Crime',
 'Thriller',
 'Action',
 'Drama',
 'Drama',
 'Drama',
 'Drama',
 'Drama',
 'Drama',
 'War',
 'Drama',
 'Drama',
 'Drama',
 "Children's",
 'Drama',
 'Comedy',
 'Crime',
 'Horror',
 'Action',
 'Drama',
 'Romance',
 'Drama',
 'Drama',
 'Comedy',
 'Drama',
 'Drama',
 'Comedy',
 'Romance',
 'Thriller',
 'Film-Noir',
 'Sci-Fi',
 'Comedy',
 'Comedy',
 'Romance',
 'Thriller',
 'Action',
 'Drama',
 'Action',
 'Adventure',
 "Children's",
 'Sci-Fi',
 'Action',
 'Adventure',
 'Thriller',
 'Action',
 'Documentary',
 'Comedy',
 'Romance',
 "Children's",
 'Comedy',
 'Musical',
 'Action',
 'Adventure',
 'Comedy',
 'Western',
 'Thriller',
 'Action',
 'Crime',
 'Romance',
 'Documentary',
 'Drama',
 'Action',
 'Adventure',
 'Animation',
 "Children's",
 'Fantasy',
 'Comedy',
 'Drama',
 'Thriller',
 'Comedy',
 'Drama',
 'Drama',
 'Comedy',
 'Horror',
 'Comedy',
 'Romance',
 'Drama',
 'Comedy',
 'Drama',
 "Children's",
 'Comedy',
 'Comedy',
 'Drama',
 'Drama',
 'Drama',
 'Drama',
 'Comedy',
 'Drama',
 "Children's",
 'Comedy',
 'Comedy',
 'Adventure',
 "Children's",
 'Drama',
 'Mystery',
 'Thriller',
 'Drama',
 'Documentary',
 'Comedy',
 'Comedy',
 'Drama',
 'Drama',
 'Comedy',
 "Children's",
 'Comedy',
 'Comedy',
 'Romance',
 'Thriller',
 'Animation',
 "Children's",
 'Comedy',
 'Musical',
 'Action',
 'Sci-Fi',
 'Thriller',
 'Adventure',
 ...]

In [36]:
genres = pd.unique(all_genres)

In [37]:
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [38]:
# Для построения индикаторного DataFrame можно, например, начать с объекта DataFrame, содержащего только нули

In [39]:
zero_matrix = np.zeros((len(movies), len(genres)))

In [40]:
zero_matrix

array([[0., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.],
       ...,
       [0., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.]])

In [41]:
dummies = pd.DataFrame(zero_matrix, columns=genres)

In [43]:
dummies # преобразовали и поставили в столбцы имена

,Animation,Children's,Comedy,Adventure,Fantasy,Romance,Drama,Action,Crime,Thriller,Horror,Sci-Fi,Documentary,War,Musical,Mystery,Film-Noir,Western
0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3878,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3879,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3880,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3881,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3882,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [46]:
# Затем перебираем все фильмы и присваиваем элементам в каждой строке объекта dummies значение 1. Для этого
# воспользуемся атрибутом dummies.columns, чтобы вычислить индексы столбцов для кажого жанра:

gen = movies['genres'][0]
gen

"Animation|Children's|Comedy"

In [47]:
type(gen)

str

In [48]:
gen.split('|')

['Animation', "Children's", 'Comedy']

In [49]:
dummies

,Animation,Children's,Comedy,Adventure,Fantasy,Romance,Drama,Action,Crime,Thriller,Horror,Sci-Fi,Documentary,War,Musical,Mystery,Film-Noir,Western
0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3878,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3879,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3880,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3881,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3882,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [53]:
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2])

In [54]:
# далее можно использовать .iloc, чтобы установить значения для этих индексов

In [55]:
for i, gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1

In [56]:
dummies

,Animation,Children's,Comedy,Adventure,Fantasy,Romance,Drama,Action,Crime,Thriller,Horror,Sci-Fi,Documentary,War,Musical,Mystery,Film-Noir,Western
0,1.0,1.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,0.0,1.0,0.0,1.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,0.0,0.0,1.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,0.0,0.0,1.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3878,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3879,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3880,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3881,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3882,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [57]:
# теперь соединяем с movies

In [58]:
movies_windic = movies.join(dummies.add_prefix('Genre'))

In [59]:
movies_windic.iloc[0]

movie_id                                      1
title                          Toy Story (1995)
genres              Animation|Children's|Comedy
GenreAnimation                              1.0
GenreChildren's                             1.0
GenreComedy                                 1.0
GenreAdventure                              0.0
GenreFantasy                                0.0
GenreRomance                                0.0
GenreDrama                                  0.0
GenreAction                                 0.0
GenreCrime                                  0.0
GenreThriller                               0.0
GenreHorror                                 0.0
GenreSci-Fi                                 0.0
GenreDocumentary                            0.0
GenreWar                                    0.0
GenreMusical                                0.0
GenreMystery                                0.0
GenreFilm-Noir                              0.0
GenreWestern                                0.0
Name: 0, dtype: object

In [60]:
# В статистических приложениях бывает полезно сочетать функцию get_dummies с той или иной функцией 
# дискретизации, например cut:

In [61]:
np.random.seed(12345)

In [64]:
values = np.random.rand(10)

In [66]:
values

array([0.74771481, 0.96130674, 0.0083883 , 0.10644438, 0.29870371,
       0.65641118, 0.80981255, 0.87217591, 0.9646476 , 0.72368535])

In [68]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]

pd.get_dummies(pd.cut(values, bins)) # очень удобно, на самом деле

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           1           0
1           0           0           0           0           1
2           1           0           0           0           0
3           1           0           0           0           0
4           0           1           0           0           0
5           0           0           0           1           0
6           0           0           0           0           1
7           0           0           0           0           1
8           0           0           0           0           1
9           0           0           0           1           0

# Манипуляция со строками

In [69]:
# Python отлично подходит для анализа данных, потому что отлично подходит для манипуляции строк.
# Бибилиотека Pandas расширяет этот инструмент, позволяя применять методы строк и регулярных выражений к целым
# массивам и беря на себя возню с отсутствующими значениями.

# Методы строковых объектов

In [71]:
# разбиваю строку с помощью split()

val = 'a,b, guido'
val.split(',')

['a', 'b', ' guido']

In [72]:
# Метод split часто употреблятся с методом strip, чтобы убрать пробельные символы, в том числе и переход на 
# новую строку

In [73]:
pis = [x.strip() for x in val.split(',')]

In [74]:
pis

['a', 'b', 'guido']

In [75]:
# Объединяем список или кортеж строк через join:

'::'.join(pis)

'a::b::guido'

In [76]:
# Поиск подстроки с помощью in:

In [78]:
'a' in  'ale'

True

In [82]:
val.index(',   ') # если подстрока не найдена - индекс возбуждает исключения

ValueError: substring not found

In [83]:
val.find(':')

-1

In [84]:
# метод replace применяется для замены и удаления;

val.replace(',', ':::')

'a:::b::: guido'

In [85]:
val.replace(',', '')

'ab guido'

In [86]:
# Методы строковых объектов:

# count - возвращает количество неперекрывающихся вхождений подстроки в строку
#
# endswith, startswith - возвращает True, если строка оканивается указанной подстрокой
#
# join - объединяет
#
# index - возвращает первую позицию вхождения подстроки в строку, иначе исключение 
#
# find - возвращает первую позицию вхождения подстроки в строку, иначе -1
#
# rfind - возвращает позицию первого вхождения последнего вхождения подстроки, иначе -1
#
# replace - замена
# 
# strip, rstrip, lstrip - удаляет пробельные символы
#
# lower - преобразует буквы в нижний регистр
#
# upper - преобразует буквы в верхний регистр
#
# ljust, rjust - выравнивает строку по левой или правой границе соответственно

# Регулярные выражения

In [87]:
# Регулярные выражения предсавляют собой простое средство сопоставления строки с образцом.
# Функции из модуля re можно отнести к трем категориям : сопоставление с образцом, замена, разбиение.

In [88]:
# Сопоставление с одним или несколькими пробельными символами служит регулярка \s+

In [11]:
import re

text = 'foo  bar\t bax    geroq'

In [90]:
re.split('\s+', text)

['foo', 'bar', 'bax', 'geroq']

In [91]:
# Напомню, что сначала компилируется регулярка, а затем только передается методу. Можно ускорить все,
# если заранее компилировать выражение методом re.compile(), создав тем самым объект, допускающий
# повторное использование

In [92]:
regex = re.compile('\s+')

In [93]:
regex.split(text)

['foo', 'bar', 'bax', 'geroq']

In [94]:
# Чтобы получить список всех подстрок, отвечающих данному регуряному выражению, воспользуемся findall():

In [95]:
regex.findall(text)

['  ', '\t ', '    ']

In [96]:
# C findall тесно связаны методы match и search. Если findall возвращает все совпадения, то search только  первое.
# А метод match находит только соответствие, начинающееся только в наачле строки

In [112]:
text = """Dave dave@google.com Steve steve@gmail.com Rob rob@gmail.com Ryan ryan@yahoo.com"""

In [113]:
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9._]+\.[A-Z]{2,4}'

In [114]:
# Флаг re.IGNORCASE делает регулярное выражение нечувствительным к регистру

In [115]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [116]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [117]:
# Метод search возвращает специальный объект соответствия для первого встретившегося в тексте адресе. В нашем
# случае этот объект может сказать только о начальной и конечной позициях найденного в строке образца:

m = regex.search(text)

In [118]:
m

In [119]:
text[m.start():m.end()] # а что, хитро придумано

'dave@google.com'

In [120]:
# Метод regex.match возвращает None, потому что он находит соответствие образцу только в начале строки

In [121]:
print(regex.match(text))

None

In [122]:
# Метод sub возвращает новую строку, в которой вхождение образца заменено указнной строкой:

regex.sub('Redacted', text)

'Dave Redacted Steve Redacted Rob Redacted Ryan Redacted'

In [123]:
# Методы регулярных выражений
#
# findall - возвращает список всех непересекающихся образцов, наденных в строке
#
# finditer - аналогичен findall, но возвращает iterator
#
# match - ищет соответствие образцу в начале строки и факультативно выделяет в образце группы. Если образец найден
# возвращается объект соответствия, иначе None
#
# search - ищет в строке образец, если найден - возвращает объект соответствия. Образец может находиться в любом месте
#
# split - разбивает строку на части в емстах вхождения образцов
#
# sub, subn - возвращает все  sub или только первые n (subn) вхождений образца указанной строкой. Чтобы в данной
# конструкции сослаться на группы, выделенные в образце, используются \1, \2 и так далее

# Векторные строковые функции  в Pandas

In [3]:
# Очистка замусоренного набора данных для последующего анализа подразумевает значительный объем манипуляций
# со строками и спользование регулярных выражений. А чтобы жизнь медом не казалась, в столбцах, содержащих строки,
# иногда встречаются пропущенные значения:

data = {'Dave' :'dave@google.com', 'Steve': 'steve@gmail.com', 'Rob': 'rob@gmail.com', 'Ryan': 'ryan@yahoo.com', 'Wes' : np.nan}

In [4]:
data = pd.Series(data)

In [5]:
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Ryan      ryan@yahoo.com
Wes                  NaN
dtype: object

In [6]:
# Посмотрим-ка пропущенные значения, с помощью метода isnull()

data.isnull()

Dave     False
Steve    False
Rob      False
Ryan     False
Wes       True
dtype: bool

In [8]:
# Методы строк и регулярных выражений можно применить к каждому значению с помощью метода data.map, которому
# передается лямбда или другая функция, но для отсутствующих значений они все сломают. Чтобы справиться с 
# этой проблемой, в классе Series есть методы для операций со строками, которые пропускают отсутствующие значения.
# Доступ к ним производится через атрибут str. Например, вот как можно было проверить с помощью метода
# str.contains проверить, содержит ли каждый почтовый адрес подстроку 'gmail'

data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Ryan     False
Wes        NaN
dtype: object

In [10]:
# Существует два способа векторной выборки элементов: str.get или доступ к атрибуту str по индексу:

pattern = r'[A-Z0-9._%+-]+@[A-Z0-9._]+\.[A-Z]{2,4}'

In [13]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [dave@google.com]
Steve    [steve@gmail.com]
Rob        [rob@gmail.com]
Ryan      [ryan@yahoo.com]
Wes                    NaN
dtype: object

In [14]:
matches = data.str.match(pattern, flags=re.IGNORECASE)

In [15]:
matches

Dave     True
Steve    True
Rob      True
Ryan     True
Wes       NaN
dtype: object

In [19]:
# Существует два способа векторной выборки элементов: str.get или доступ к атрибуту str по индексу:

matches.str[0]

AttributeError: Can only use .str accessor with string values!